/****************************************************************************
* 文 件 名: main.c
* 作    者: Andy
* 修    订: 2013-01-10
* 版    本: 1.0
* 描    述: MQ-2气体传感器,当测量浓度大于设定浓度时，LED1会闪烁,MQ-2上的DD-LED
*          也会长亮。如果另外一个IO接蜂鸣器就可报警了，自己DIY吧!
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1     P1_0            //定义P1.0口为LED1控制端
#define DATA_PIN P0_6            //定义P0.6口为传感器的输入端

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时 16M时约为535,系统时钟不修改默认为16M
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}

/****************************************************************************
* 名    称: InitGpio()
* 功    能: 设置LED灯和MQ2相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitGpio(void)
{
    P1DIR |= 0x01;               //P1.0定义为输出口
    P0DIR &= ~0x40;              //P0.6定义为输入口
}

void main(void)
{  
    uint i=0;
    
    InitGpio();                    //设置LED灯和MQ2相应的IO口

    while(1)                      //无限循环
    {
        LED1 = 1;                 //熄灭P1.0口灯    
        if(DATA_PIN == 0)         //当浓度高于设定值时 ，执行条件函数        
        {
            DelayMS(10);          //延时抗干扰
            if(DATA_PIN == 0)     //确定 浓度高于设定值时 ，执行条件函数
            {
                for (i=0; i<10; i++)
                {
                    LED1 = ~LED1; //闪烁LED1，提示用户
                    DelayMS(100);
                }
            }
        }
    }    
}
